Repository: by22shh/life-os
Catalog: ios/LifeOS/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# menstrual_tracking_off
source: Tracking off
ru: Отслеживание выключено

# menstrual_unavailable
source: Sign in to log menstrual data.
ru: Войдите в аккаунт, чтобы вести журнал цикла.

# settings_medical_scan_local_only
source: Medical scans local only
ru: Медсканы только локально

# settings_cloud_backup_enabled
source: Cloud backup for health flags
ru: Облачный бэкап флагов здоровья

# settings_vector_opt_in
source: Vector memory opt-in
ru: Согласие на векторную память

# settings_analytics_consent
source: Analytics consent
ru: Согласие на аналитику

# settings_cloud_ocr_enabled
source: Cloud OCR enabled
ru: Облачный OCR включен

source: Date
ru: Дата

# hydration_default_progress
source: 0 / 2,500 mL
ru: 0 / 2 500 мл

# recovery_zone_desc_critical
source: Rest required
ru: Нужен отдых

# recovery_zone_desc_caution
source: Take it easy
ru: Снизьте нагрузку

# recovery_zone_desc_ready
source: Good to go
ru: Можно тренироваться

# recovery_zone_desc_optimal
source: Ready for anything
ru: Готов к нагрузке

# micro_zone_solid
source: Solid
ru: Стабильно

# micro_zone_strong
source: Strong
ru: Сильно

# micro_zone_peak
source: Peak
ru: Пик

# recovery_zone_accessibility_prefix
source: Recovery zone:
ru: Зона восстановления:

# recovery_announcement_prefix
source: Recovery:
ru: Восстановление:

# recovery_percent_label
source: percent
ru: процентов

# insights_confidence_low_badge
source: Low confidence
ru: Низкая уверенность

# nutrition_method_photo
source: Photo
ru: Фото

# nutrition_method_barcode
source: Barcode
ru: Штрихкод

# nutrition_method_voice
source: Voice
ru: Голос

# nutrition_method_manual
source: Manual
ru: Вручную

# nutrition_method_vision
source: Vision
ru: Фото AI

# nutrition_method_batch
source: Batch
ru: Партия

# nutrition_method_template
source: Template
ru: Шаблон

# sleep_title
source: Sleep
ru: Сон

# sleep_supportive_more_data
source: Sleep trends need a bit more data. Keep a steady routine and review again tomorrow.
ru: Нужно немного больше данных по сну. Сохраняйте стабильный режим и проверьте снова завтра.

# sleep_supportive_in_range
source: Your deep and REM patterns are in a healthy range for your age.
ru: Показатели глубокого и REM-сна находятся в хорошем диапазоне для вашего возраста.

# sleep_supportive_both_outside
source: Your stage pattern is a little off your usual targets today. Focus on consistency rather than a perfect night.
ru: Структура сна сегодня немного отклоняется от целевых значений. Лучше фокусироваться на стабильности, а не на идеальной ночи.

# sleep_supportive_deep_outside
source: Deep sleep is slightly outside your age-adjusted target. Gentle routine tweaks can help over time.
ru: Глубокий сон немного вне возрастного целевого диапазона. Небольшие корректировки режима обычно помогают со временем.

# sleep_supportive_rem_outside
source: REM sleep is slightly outside your age-adjusted target. Keep your routine steady and reassess over several nights.
ru: REM-сон немного вне возрастного целевого диапазона. Сохраняйте стабильный режим и оцените динамику за несколько ночей.

# auth_error_invalid_credential
source: Invalid sign-in credential.
ru: Недействительные данные для входа.

# auth_error_apple_sign_in_unavailable
source: Sign in with Apple is unavailable in this build.
ru: В этой сборке вход через Apple недоступен.

# auth_error_session_expired
source: Your session has expired. Please sign in again.
ru: Сессия истекла. Войдите снова.

# auth_error_network_unavailable
source: No network connection. Your data is saved locally.
ru: Нет подключения к сети. Данные сохранены локально.

# auth_error_local_only_mode
source: Cloud sign-in is unavailable in this local-only build.
ru: В этой локальной сборке облачный вход недоступен.

# auth_error_invalid_email
source: Please enter a valid email address.
ru: Введите корректный адрес электронной почты.

# auth_error_invalid_otp
source: Please enter the 6-digit code from your email.
ru: Введите 6-значный код из письма.

# auth_email_hint_invalid
source: Enter a valid email, e.g. name@example.com
ru: Введите корректный email, например name@example.com

# nutrition_review_gate_message
source: Low confidence detection. Please review and edit before saving.
ru: Низкая уверенность распознавания. Перед сохранением проверьте и отредактируйте.

# nutrition_review_gate_confirm
source: I reviewed this meal manually
ru: Я вручную проверил(а) это блюдо

# nutrition_save_meal_cta
source: Save meal
ru: Сохранить приём пищи

# nutrition_analyzing_photo
source: Analyzing photo...
ru: Анализируем фото...

# nutrition_use_photo
source: Use photo analysis
ru: Использовать анализ фото

# nutrition_take_photo_prompt
source: Take or choose a meal photo to detect foods automatically.
ru: Сделайте или выберите фото блюда, чтобы автоматически распознать продукты.

# nutrition_open_camera
source: Open camera
ru: Открыть камеру

# nutrition_choose_photo
source: Choose photo
ru: Выбрать фото

# nutrition_photo_title
source: Photo meal
ru: Фото приёма пищи

# nutrition_photo_analyzed
source: Photo processed. Review the meal before saving.
ru: Фото обработано. Проверьте приём пищи перед сохранением.

# nutrition_photo_ai_analysis_title
source: AI meal analysis
ru: AI-анализ блюда

# nutrition_photo_fallback_summary_title
source: On-device detection
ru: Локальное распознавание

# nutrition_photo_analysis_title
source: Meal analysis
ru: Анализ блюда

# nutrition_photo_ai_detected_items_title
source: AI-detected items
ru: AI-распознанные продукты

# nutrition_photo_detected_items_title
source: Detected items
ru: Распознанные продукты

# nutrition_photo_structured_save_notice
source: Detected items will be saved as structured food entries.
ru: Распознанные продукты будут сохранены как структурированные записи.

# nutrition_photo_review_save_notice
source: Detected data will be saved for manual review with this meal.
ru: Распознанные данные будут сохранены для ручной проверки вместе с этим приёмом пищи.

# nutrition_photo_barcodes_title
source: Detected barcodes
ru: Обнаруженные штрихкоды

# nutrition_photo_ocr_hints_title
source: OCR hints used by AI
ru: OCR-подсказки для AI

# nutrition_photo_captured_text_title
source: Captured text
ru: Распознанный текст

# nutrition_photo_estimated_macros_title
source: Estimated macros
ru: Оценка макросов

# nutrition_photo_review_notes_title
source: Review notes
ru: Что проверить

# nutrition_photo_suggestions_title
source: Suggestions
ru: Рекомендации

# nutrition_item_needs_review
source: Needs review
ru: Нужна проверка

# nutrition_item_barcode_format
source: Barcode %@
ru: Штрихкод %@

# nutrition_photo_macros_with_fiber_format
source: %d kcal • %dg P • %dg F • %dg C • %dg fiber
ru: %d ккал • %dг Б • %dг Ж • %dг У • %dг клетчатки

# nutrition_photo_macros_without_fiber_format
source: %d kcal • %dg P • %dg F • %dg C
ru: %d ккал • %dг Б • %dг Ж • %dг У

# nutrition_photo_cloud_disabled_notice
source: Cloud food analysis is disabled in Privacy settings. Using on-device detection only.
ru: Облачный анализ питания отключён в настройках приватности. Используется только локальное распознавание.

# nutrition_photo_fallback_notice
source: AI meal analysis is temporarily unavailable. Using on-device text and barcode detection.
ru: AI-анализ блюда временно недоступен. Используется локальное распознавание текста и штрихкодов.

# nutrition_photo_ai_summary_fallback_format
source: Estimated meal: %@. Approx. %d kcal.
ru: Оценённый приём пищи: %@. Примерно %d ккал.

# nutrition_photo_ai_summary_names_only_format
source: Estimated meal: %@.
ru: Оценённый приём пищи: %@.

# nutrition_photo_local_hint_barcode_format
source: Barcode hint: %@
ru: Подсказка по штрихкоду: %@

# nutrition_photo_local_hint_text_format
source: Text hint: %@
ru: Текстовая подсказка: %@

# nutrition_dynamic_adjustment_hint_format
source: Adaptive target: %d kcal • %dg P • %dg F • %dg C
ru: Адаптивная цель: %d ккал • %dг Б • %dг Ж • %dг У

# diary_meals_logged_format
source: Meals logged: %d
ru: Приёмов пищи: %d

# diary_target_summary_format
source: Target: %d kcal • %dg P • %dg F • %dg C
ru: Цель: %d ккал • %dг Б • %dг Ж • %dг У

# clinician_disclaimer
source: Consult your clinician.
ru: Проконсультируйтесь с вашим лечащим врачом.

# error.healthkit.auth_denied
source: Health data access denied
ru: Доступ к данным HealthKit отклонен

# error.healthkit.invalid_sample
source: Invalid measurement: %@
ru: Некорректное измерение: %@

# error.healthkit.no_data
source: No data available for this date
ru: За эту дату нет данных

# error.healthkit.not_available
source: HealthKit is not available on this device
ru: HealthKit недоступен на этом устройстве

# error.healthkit.sdnn_too_low
source: SDNN too low (%.1fms) — rejected as noise
ru: SDNN слишком низкий (%.1f мс) — отклонено как шум

# error.labs.extraction_failed
source: Unable to extract markers from this scan
ru: Не удалось извлечь показатели из этого скана

# error.labs.low_confidence
source: Low confidence extraction. Please review values before saving.
ru: Низкая уверенность распознавания. Перед сохранением проверьте значения.

# error.labs.unsupported_document
source: This lab document format is not supported yet
ru: Этот формат лабораторного документа пока не поддерживается

# error.nutrition.barcode_not_found
source: Product with barcode %@ not found
ru: Продукт со штрихкодом %@ не найден

# error.nutrition.catalog_unavailable
source: Food catalog temporarily unavailable
ru: Каталог продуктов временно недоступен

# error.nutrition.duplicate_log
source: This meal has already been logged
ru: Этот прием пищи уже записан

# error.nutrition.image_too_large
source: Photo exceeds %d MB
ru: Фото превышает %d МБ

# error.nutrition.invalid_macros
source: Invalid macronutrient data: %@
ru: Некорректные данные макронутриентов: %@

# error.nutrition.template_empty
source: Template contains no food items
ru: Шаблон не содержит продуктов

# error.privacy.deletion_scheduled
source: Account deletion scheduled for %@
ru: Удаление аккаунта запланировано на %@

# error.privacy.export_in_progress
source: Data export is already in progress
ru: Экспорт данных уже выполняется

# error.privacy.export_not_ready
source: Data export is not ready yet
ru: Экспорт данных пока не готов

# error.recovery.computation_failed
source: Computation error: %@
ru: Ошибка вычисления: %@

# error.recovery.insufficient_baseline
source: Not enough data days (%d/%d) for baseline calculation
ru: Недостаточно дней данных (%d/%d) для расчета базовой линии

# error.recovery.no_state
source: No physiological data for %@
ru: Нет физиологических данных за %@

# error.settings.consent_version
source: Please re-confirm consent for the latest policy version
ru: Подтвердите согласие для актуальной версии политики

# error.settings.deletion_failed
source: Account deletion request failed
ru: Не удалось отправить запрос на удаление аккаунта

# error.settings.export_failed
source: Unable to prepare your export right now
ru: Сейчас не удалось подготовить экспорт

# error.settings.save_failed
source: Unable to save settings right now
ru: Сейчас не удалось сохранить настройки

# error.supplements.invalid_dose
source: Dose is outside a safe range
ru: Доза выходит за безопасный диапазон

# error.supplements.reminder_window
source: Reminder time falls inside quiet hours
ru: Время напоминания попадает в тихие часы

# error.supplements.schedule_conflict
source: Schedule conflicts with an existing supplement reminder
ru: Расписание конфликтует с существующим напоминанием о приеме добавки

# error.sync.auth_required
source: Re-authentication required
ru: Требуется повторный вход

# error.sync.conflict
source: Data conflict in %@
ru: Конфликт данных в %@

# error.sync.max_retries
source: Maximum send attempts exceeded
ru: Превышено максимальное число попыток отправки

# error.sync.network_unavailable
source: No internet connection
ru: Нет подключения к интернету

# error.sync.server_error
source: Server error %d: %@
ru: Ошибка сервера %d: %@

# error.sync.watermark_corrupted
source: Sync watermark corrupted for %@
ru: Поврежден watermark синхронизации для %@

# error.training.exercise_not_found
source: Exercise not found
ru: Упражнение не найдено

# error.training.invalid_set
source: Invalid set data: %@
ru: Некорректные данные подхода: %@

# error.training.plan_limit
source: Maximum %d plans reached
ru: Достигнут лимит: %d планов

# error.training.workout_active
source: A workout is already in progress
ru: Тренировка уже идет

# recovery_calibrating_progress_format
source: Calibrating: %d of %d days
ru: Калибровка: %d из %d дней

# setup_getting_ready
source: Getting Ready
ru: Настройка

# setup_connect_health
source: Connect Apple Health
ru: Подключить Apple Health

# setup_connect_health_subtitle
source: HRV, sleep, and heart rate power your Recovery Score
ru: ВСР, сон и пульс — основа вашего Recovery Score

# setup_set_weight
source: Set your weight
ru: Укажите вес

# setup_set_weight_subtitle
source: Used for personalized nutrition targets
ru: Для персональных целей по питанию

# setup_build_baseline
source: Build your baseline
ru: Собрать базовую линию

# setup_baseline_complete
source: Your personal baseline is ready
ru: Ваша базовая линия готова

# setup_baseline_progress_format
source: %d of %d days collected
ru: %d из %d дней собрано

# setup_log_first_meal
source: Log your first meal
ru: Залогируйте первый приём пищи

# setup_log_first_meal_subtitle
source: Photo, barcode, or manual — your choice
ru: Фото, штрих-код или вручную — как удобнее

# setup_wellness_check
source: Complete a wellness check
ru: Пройдите wellness-опрос

# setup_wellness_check_subtitle
source: Quick daily check-in for mood and energy
ru: Краткий ежедневный опрос: настроение и энергия

# setup_done
source: Done
ru: Готово

# setup_tap_to_complete
source: Tap to complete this step
ru: Нажмите, чтобы выполнить этот шаг

# onboarding_weight_title
source: Your weight
ru: Ваш вес

# onboarding_weight_description
source: We use your weight to personalize nutrition targets and recovery calculations.
ru: Вес нужен для персональных целей по питанию и расчётов восстановления.

# onboarding_weight_input_label
source: Weight in kilograms
ru: Вес в килограммах

# onboarding_weight_why
source: This adjusts your protein, calorie, and hydration targets
ru: Это настраивает цели по белку, калориям и гидратации

# onboarding_hk_hrv
source: Heart Rate Variability
ru: Вариабельность сердечного ритма

# onboarding_hk_sleep
source: Sleep duration & stages
ru: Продолжительность и фазы сна

# onboarding_hk_rhr
source: Resting Heart Rate
ru: Пульс в покое

# onboarding_hk_temp
source: Wrist Temperature
ru: Температура запястья

# onboarding_hk_privacy
source: Read-only access. We never write to your Health data.
ru: Только чтение. Мы не записываем данные в Apple Health.

# onboarding_skip_for_now
source: Skip for now
ru: Пропустить

# onboarding_step_save_failed
source: We couldn't save your onboarding progress. Try again.
ru: Не удалось сохранить ваш прогресс онбординга. Попробуйте ещё раз.

# onboarding_backfill_failed
source: We couldn't import your recent Apple Health data. Try again.
ru: Не удалось импортировать последние данные из Apple Health. Попробуйте ещё раз.

# onboarding_retry_cta
source: Try again
ru: Повторить

# onboarding_backfill_done
source: Data imported
ru: Данные импортированы

# onboarding_backfill_done_subtitle
source: We've pulled your last 14 days of health data.
ru: Мы загрузили ваши данные о здоровье за последние 14 дней.

# onboarding_next_baseline
source: Your Recovery Score calibrates over 5 days
ru: Recovery Score калибруется за 5 дней

# onboarding_next_insights
source: Personalized insights appear as data grows
ru: Персональные инсайты появятся по мере накопления данных

# onboarding_next_nutrition
source: Log meals to unlock nutrition tracking
ru: Логируйте приёмы пищи для трекинга питания

# unit_kg
source: kg
ru: кг

# unit_cm
source: cm
ru: см

# privacy_note_photo_retention
source: Photos auto-delete after 90 days
ru: Фото автоудаляются через 90 дней

# privacy_note_menstrual_local
source: Stored only on this device
ru: Хранится только на этом устройстве

# privacy_note_medical_local
source: Scan data stays on this device
ru: Данные скана остаются на устройстве

# privacy_note_medical_retention
source: Scan images auto-delete after 90 days
ru: Изображения сканов удаляются через 90 дней

# privacy_note_ai_cache
source: AI analysis cached for 7 days, then deleted
ru: AI-анализ хранится 7 дней, затем удаляется

# privacy_note_healthkit_readonly
source: Read-only. We never write to Health.
ru: Только чтение. Мы не записываем в Health.

# privacy_note_on_device
source: This data never leaves your device
ru: Эти данные не покидают ваше устройство

# settings_danger_zone
source: Danger Zone
ru: Опасная зона

# settings_delete_account
source: Delete account
ru: Удалить аккаунт

# settings_delete_account_accessibility
source: Delete your account and schedule permanent data removal
ru: Удалить аккаунт и запланировать окончательное удаление данных

# settings_delete_account_footer
source: Deleting your account schedules permanent data removal after the grace period.
ru: Удаление аккаунта планирует окончательное удаление данных после льготного периода.

# settings_delete_account_confirm_title
source: Delete account?
ru: Удалить аккаунт?

# settings_delete_account_confirm_action
source: Schedule deletion
ru: Запланировать удаление

# settings_delete_account_cancel
source: Cancel
ru: Отмена

# settings_delete_account_confirm_body
source: We will schedule your account for deletion and keep the current grace period before permanent removal.
ru: Мы запланируем удаление аккаунта и сохраним текущий льготный период до окончательного удаления.

# settings_delete_account_scheduled
source: Account deletion request queued.
ru: Запрос на удаление аккаунта поставлен в очередь.

# settings_delete_account_status_section
source: Deletion status
ru: Статус удаления

# settings_delete_account_status_none
source: No deletion scheduled
ru: Удаление не запланировано

# settings_delete_account_status_queued
source: Deletion queued locally
ru: Удаление поставлено в локальную очередь

# settings_delete_account_status_scheduled
source: Deletion scheduled
ru: Удаление запланировано

# settings_delete_account_status_in_progress
source: Deletion in progress
ru: Удаление выполняется

# settings_delete_account_status_cancel_queued
source: Cancellation queued locally
ru: Отмена поставлена в локальную очередь

# settings_delete_account_status_failed
source: Deletion needs attention
ru: Удаление требует внимания

# settings_delete_account_scheduled_for
source: Scheduled for
ru: Запланировано на

# settings_delete_account_state_label
source: Workflow
ru: Этап

# settings_delete_account_mode_label
source: Mode
ru: Режим

# settings_delete_account_reason_label
source: Reason
ru: Причина

# settings_delete_account_attempts_label
source: Attempts
ru: Попытки

# settings_delete_account_retry_after_label
source: Retry after
ru: Повтор через

# settings_delete_account_refresh_status
source: Refresh deletion status
ru: Обновить статус удаления

# settings_delete_account_cancel_scheduled
source: Cancel scheduled deletion
ru: Отменить запланированное удаление

# settings_delete_account_cancel_requested
source: Deletion cancellation queued.
ru: Отмена удаления поставлена в очередь.

# settings_delete_account_in_progress_note
source: Deletion has started and can no longer be cancelled from the app.
ru: Удаление уже началось и больше не может быть отменено из приложения.

# settings_delete_account_scheduled_note
source: Your account is scheduled for deletion but can still be cancelled during the grace period.
ru: Ваш аккаунт запланирован к удалению, но его ещё можно отменить в течение льготного периода.

# settings_delete_account_failed_note
source: The deletion workflow needs attention. Try refreshing status or syncing again.
ru: Процесс удаления требует внимания. Попробуйте обновить статус или повторить синхронизацию.

# settings_delete_account_state_requested
source: Requested
ru: Запрошено

# settings_delete_account_state_scheduled
source: Scheduled
ru: Запланировано

# settings_delete_account_state_auth_deleting
source: Removing account access
ru: Удаление доступа к аккаунту

# settings_delete_account_state_data_deleting
source: Deleting stored data
ru: Удаление сохранённых данных

# settings_delete_account_state_vector_verifying
source: Verifying vector cleanup
ru: Проверка очистки векторных данных

# settings_delete_account_state_retry_scheduled
source: Retry scheduled
ru: Запланирован повтор

# settings_delete_account_state_completed
source: Completed
ru: Завершено

# settings_delete_account_state_failed
source: Failed
ru: Ошибка

# settings_delete_account_state_cancelled
source: Cancelled
ru: Отменено

# settings_delete_account_mode_scheduled
source: Scheduled
ru: Запланировано

# settings_delete_account_mode_immediate
source: Immediate
ru: Немедленно

# settings_delete_account_mode_local_only
source: Local only
ru: Только локально

# settings_delete_account_reason_user_requested
source: Requested by you
ru: Запрошено вами

# settings_delete_account_local_only_completed
source: All account data stored on this device was deleted immediately.
ru: Все данные аккаунта на этом устройстве были удалены сразу.

# settings_privacy_footer
source: Your health data is private by default. We only sync what you explicitly allow.
ru: Ваши данные о здоровье приватны по умолчанию. Мы синхронизируем только то, что вы явно разрешите.

# auth_error_link_requires_cloud_session
source: Linking this account requires an active cloud session.
ru: Чтобы привязать этот аккаунт, нужна активная облачная сессия.

# auth_error_cloud_session_reconnect_required
source: Reconnect your account to continue using cloud features.
ru: Переподключите аккаунт, чтобы снова пользоваться облачными функциями.

# control_level_advisory
source: Advisory
ru: Рекомендательный

# control_level_guardian
source: Guardian
ru: Опекунский

# control_level_protective
source: Protective
ru: Защитный

# diary_review_empty_state
source: Everything is reviewed for now.
ru: Сейчас всё проверено.

# diary_review_food_logs_detail_format
source: %d food logs need review
ru: %d записей питания ждут проверки

# diary_review_food_logs_title
source: Review food logs
ru: Проверить записи питания

# diary_review_insights_detail_format
source: %d insights need review
ru: %d инсайтов ждут проверки

# diary_review_insights_title
source: Review insights
ru: Проверить инсайты

# diary_review_mode_title
source: Review queue
ru: Очередь проверки

# diary_review_summary_format
source: %d items need your review.
ru: %d элементов ждут вашей проверки.

# diary_supplements_taken_format
source: %d of %d taken
ru: Принято %d из %d

# diary_workouts_format
source: %d workouts
ru: %d тренировок

# error.experiment.already_active
source: An experiment is already active.
ru: Эксперимент уже активен.

# error.experiment.duration_exceeded
source: Experiment duration exceeds the allowed limit.
ru: Длительность эксперимента превышает допустимый предел.

# error.experiment.insufficient_baseline
source: Not enough baseline data to continue this experiment.
ru: Недостаточно базовых данных, чтобы продолжить этот эксперимент.

# error.experiment.invalid_protocol
source: This experiment protocol is invalid.
ru: Протокол этого эксперимента недействителен.

# error.hydration.daily_limit
source: Daily hydration limit reached.
ru: Дневной лимит воды достигнут.

# error.hydration.invalid_amount
source: Enter a valid hydration amount.
ru: Введите корректный объём воды.

# error.hydration.target_not_set
source: Set a hydration target first.
ru: Сначала задайте цель по воде.
